memcachedTestResult/memcachedTestResult-5nd-set_memtier_benchmark_on_host_hwBenchmark-gauss82/FM-1st-testTime40/memcached_test_result_P7_FM_OFF_1nd_20230809161756.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1540.41          ---          ---        12.73327        12.73500        26.49500        40.70300      1656.24 
Gets         6150.78      5132.44      1018.33        13.06073        12.79900        27.39100        40.70300      5856.70 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       7691.19      5132.44      1018.33        12.99514        12.73500        27.26300        40.70300      7512.94 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       5.055        0.000
SET       7.391        5.000
SET       9.279       10.000
SET      11.263       15.000
SET      11.711       20.000
SET      11.967       25.000
SET      12.159       30.000
SET      12.351       35.000
SET      12.479       40.000
SET      12.607       45.000
SET      12.735       50.000
SET      12.799       52.500
SET      12.799       55.000
SET      12.863       57.500
SET      12.927       60.000
SET      12.991       62.500
SET      13.055       65.000
SET      13.055       67.500
SET      13.119       70.000
SET      13.183       72.500
SET      13.247       75.000
SET      13.311       76.250
SET      13.375       77.500
SET      13.375       78.750
SET      13.439       80.000
SET      13.503       81.250
SET      13.567       82.500
SET      13.567       83.750
SET      13.631       85.000
SET      13.695       86.250
SET      13.823       87.500
SET      13.823       88.125
SET      13.887       88.750
SET      13.951       89.375
SET      14.015       90.000
SET      14.079       90.625
SET      14.143       91.250
SET      14.207       91.875
SET      14.271       92.500
SET      14.399       93.125
SET      14.527       93.750
SET      14.591       94.062
SET      14.655       94.375
SET      14.783       94.688
SET      14.911       95.000
SET      15.103       95.312
SET      15.359       95.625
SET      15.679       95.938
SET      16.127       96.250
SET      16.639       96.562
SET      17.535       96.875
SET      17.919       97.031
SET      18.687       97.188
SET      19.583       97.344
SET      20.607       97.500
SET      21.503       97.656
SET      22.271       97.812
SET      22.911       97.969
SET      23.423       98.125
SET      24.191       98.281
SET      24.831       98.438
SET      25.087       98.516
SET      25.343       98.594
SET      25.727       98.672
SET      25.855       98.750
SET      26.111       98.828
SET      26.239       98.906
SET      26.495       98.984
SET      26.623       99.062
SET      26.879       99.141
SET      27.135       99.219
SET      27.135       99.258
SET      27.391       99.297
SET      27.391       99.336
SET      27.519       99.375
SET      27.647       99.414
SET      27.775       99.453
SET      27.903       99.492
SET      28.031       99.531
SET      28.159       99.570
SET      28.415       99.609
SET      28.543       99.629
SET      28.671       99.648
SET      28.671       99.668
SET      28.799       99.688
SET      29.055       99.707
SET      29.183       99.727
SET      29.439       99.746
SET      29.695       99.766
SET      30.079       99.785
SET      30.847       99.805
SET      31.743       99.814
SET      32.511       99.824
SET      34.559       99.834
SET      36.351       99.844
SET      37.887       99.854
SET      38.399       99.863
SET      39.167       99.873
SET      39.935       99.883
SET      40.191       99.893
SET      41.471       99.902
SET      41.983       99.907
SET      42.751       99.912
SET      43.775       99.917
SET     216.063       99.922
SET     219.135       99.927
SET     222.207       99.932
SET     224.255       99.937
SET     224.255       99.941
SET     226.303       99.946
SET     228.351       99.951
SET     229.375       99.954
SET     229.375       99.956
SET     232.447       99.958
SET     232.447       99.961
SET     233.471       99.963
SET     233.471       99.966
SET     235.519       99.968
SET     236.543       99.971
SET     239.615       99.973
SET     239.615       99.976
SET     240.639       99.977
SET     240.639       99.978
SET     240.639       99.979
SET     240.639       99.980
SET     241.663       99.982
SET     242.687       99.983
SET     242.687       99.984
SET     242.687       99.985
SET     242.687       99.987
SET     244.735       99.988
SET     244.735       99.988
SET     244.735       99.989
SET     244.735       99.990
SET     244.735       99.990
SET     246.783       99.991
SET     246.783       99.991
SET     250.879       99.992
SET     250.879       99.993
SET     250.879       99.993
SET     252.927       99.994
SET     252.927       99.994
SET     252.927       99.995
SET     252.927       99.995
SET     252.927       99.995
SET     253.951       99.995
SET     253.951       99.996
SET     253.951       99.996
SET     253.951       99.996
SET     253.951       99.997
SET     253.951       99.997
SET     253.951       99.997
[...]
SET     253.951       99.998
SET     253.951       99.998
SET     253.951       99.998
[...]
SET     274.431       99.998
SET     274.431      100.000
---
GET       2.175        0.000
GET       8.575        5.000
GET      11.199       10.000
GET      11.647       15.000
GET      11.903       20.000
GET      12.095       25.000
GET      12.287       30.000
GET      12.415       35.000
GET      12.543       40.000
GET      12.671       45.000
GET      12.799       50.000
GET      12.799       52.500
GET      12.863       55.000
GET      12.927       57.500
GET      12.991       60.000
GET      13.055       62.500
GET      13.055       65.000
GET      13.119       67.500
GET      13.183       70.000
GET      13.247       72.500
GET      13.375       75.000
GET      13.375       76.250
GET      13.439       77.500
GET      13.439       78.750
GET      13.503       80.000
GET      13.567       81.250
GET      13.631       82.500
GET      13.695       83.750
GET      13.759       85.000
GET      13.823       86.250
GET      13.887       87.500
GET      13.951       88.125
GET      14.015       88.750
GET      14.079       89.375
GET      14.143       90.000
GET      14.207       90.625
GET      14.271       91.250
GET      14.335       91.875
GET      14.463       92.500
GET      14.591       93.125
GET      14.783       93.750
GET      14.847       94.062
GET      15.039       94.375
GET      15.231       94.688
GET      15.423       95.000
GET      15.743       95.312
GET      16.191       95.625
GET      16.895       95.938
GET      17.791       96.250
GET      19.839       96.562
GET      22.143       96.875
GET      22.783       97.031
GET      23.295       97.188
GET      23.807       97.344
GET      24.319       97.500
GET      24.831       97.656
GET      25.215       97.812
GET      25.599       97.969
GET      25.855       98.125
GET      26.111       98.281
GET      26.495       98.438
GET      26.623       98.516
GET      26.751       98.594
GET      26.879       98.672
GET      27.007       98.750
GET      27.135       98.828
GET      27.263       98.906
GET      27.391       98.984
GET      27.519       99.062
GET      27.647       99.141
GET      27.903       99.219
GET      27.903       99.258
GET      28.031       99.297
GET      28.159       99.336
GET      28.159       99.375
GET      28.287       99.414
GET      28.415       99.453
GET      28.543       99.492
GET      28.671       99.531
GET      28.799       99.570
GET      28.927       99.609
GET      29.055       99.629
GET      29.183       99.648
GET      29.311       99.668
GET      29.439       99.688
GET      29.567       99.707
GET      29.823       99.727
GET      30.079       99.746
GET      30.335       99.766
GET      30.719       99.785
GET      32.255       99.805
GET      33.791       99.814
GET      35.071       99.824
GET      35.839       99.834
GET      36.863       99.844
GET      37.631       99.854
GET      38.399       99.863
GET      39.167       99.873
GET      39.679       99.883
GET      40.191       99.893
GET      40.959       99.902
GET      41.215       99.907
GET      41.727       99.912
GET      42.239       99.917
GET      42.495       99.922
GET      43.007       99.927
GET      44.543       99.932
GET     227.327       99.937
GET     229.375       99.941
GET     231.423       99.946
GET     233.471       99.951
GET     235.519       99.954
GET     235.519       99.956
GET     236.543       99.958
GET     237.567       99.961
GET     237.567       99.963
GET     238.591       99.966
GET     238.591       99.968
GET     239.615       99.971
GET     240.639       99.973
GET     240.639       99.976
GET     241.663       99.977
GET     241.663       99.978
GET     241.663       99.979
GET     242.687       99.980
GET     242.687       99.982
GET     242.687       99.983
GET     243.711       99.984
GET     243.711       99.985
GET     244.735       99.987
GET     244.735       99.988
GET     245.759       99.988
GET     245.759       99.989
GET     245.759       99.990
GET     245.759       99.990
GET     245.759       99.991
GET     245.759       99.991
GET     245.759       99.992
GET     245.759       99.993
GET     246.783       99.993
GET     247.807       99.994
GET     247.807       99.994
GET     247.807       99.995
GET     247.807       99.995
GET     247.807       99.995
GET     248.831       99.995
GET     248.831       99.996
GET     249.855       99.996
GET     249.855       99.996
GET     249.855       99.997
GET     250.879       99.997
GET     250.879       99.997
GET     250.879       99.997
[...]
GET     250.879       99.998
GET     251.903       99.998
GET     251.903       99.998
GET     253.951       99.998
GET     253.951       99.998
GET     253.951       99.998
GET     255.999       99.998
GET     255.999       99.999
GET     255.999       99.999
GET     255.999       99.999
[...]
GET     266.239       99.999
GET     266.239       99.999
GET     266.239       99.999
[...]
GET     266.239      100.000
GET     266.239      100.000
GET     266.239      100.000
GET     401.407      100.000
GET     401.407      100.000
---
WAIT      0.000      100.000